In [1]:
import pandas as pd
import numpy as np
import python_functions_sp as pf
import warnings
warnings.filterwarnings("ignore")
import sqlalchemy
import psycopg2
import sql_functions_sp as sf

In [2]:
PISA_m = pd.read_excel('data/2000-2022_m_r.xls', sheet_name='mathematics', header=11)
PISA_r = pd.read_excel('data/2000-2022_m_r.xls', sheet_name='reading', header=11)
PISA_sc = pd.read_excel('data/2000-2022_sc.xls', sheet_name='science', header=11)

In [3]:
PISA_m.head()

,Unnamed: 0,Year/Study,Jurisdiction,Average,Standard Error
0,NaN,2022,Selected countries and jurisdictions,437.628559,0.266429
1,NaN,2022,International Average (OECD),472.358125,0.397751
2,NaN,2022,Australia,487.084254,1.779614
3,NaN,2022,Austria,487.267499,2.337789
4,NaN,2022,Belgium,489.486817,2.202874

In [4]:
PISA_r.head()

,Unnamed: 0,Year/Study,Jurisdiction,Average,Standard Error
0,NaN,2022,Selected countries and jurisdictions,435.037917,0.295268
1,NaN,2022,International Average (OECD),475.588873,0.452402
2,NaN,2022,Australia,498.05094,2.013591
3,NaN,2022,Austria,480.405847,2.668254
4,NaN,2022,Belgium,478.852668,2.523596

In [5]:
PISA_sc.head()

,Unnamed: 0,Year/Study,Jurisdiction,Average,Standard Error
0,NaN,2022,Selected countries and jurisdictions,446.893945,0.282993
1,NaN,2022,International Average (OECD),484.646614,0.435314
2,NaN,2022,Australia,507.000869,1.933076
3,NaN,2022,Austria,491.270959,2.650135
4,NaN,2022,Belgium,490.578346,2.481873

In [6]:
PISA_m = PISA_m.drop('Unnamed: 0', axis=1)
PISA_r = PISA_r.drop('Unnamed: 0', axis=1)
PISA_sc = PISA_sc.drop('Unnamed: 0', axis=1)

---

Put column names in lower case, snake case and rename:

In [7]:
dataframes = [PISA_m, PISA_r, PISA_sc]

pf.columns_lower_snake_case(dataframes)

Index(['year', 'jurisdiction', 'average', 'standard_error'], dtype='object')
------------------------------
Index(['year', 'jurisdiction', 'average', 'standard_error'], dtype='object')
------------------------------
Index(['year', 'jurisdiction', 'average', 'standard_error'], dtype='object')
------------------------------

[                                                  year
 0                                                 2022  \
 1                                                 2022
 2                                                 2022
 3                                                 2022
 4                                                 2022
 ..                                                 ...
 785                     ‡ Reporting standards not met.
 786                                   — Not available.
 787                                  † Not applicable.
 788  NOTE: B-S-J-G (China) refers to the four PISA ...
 789  SOURCE: Organization for Economic Cooperation ...

                              jurisdiction     average standard_error
 0    Selected countries and jurisdictions  437.628559       0.266429
 1            International Average (OECD)  472.358125       0.397751
 2                               Australia  487.084254       1.779614
 3                                 Austria  487.267499       2.337789
 4                                 Belgium  489.486817       2.202874
 ..                                    ...         ...            ...
 785                                   NaN         NaN            NaN
 786                                   NaN         NaN            NaN
 787                                   NaN         NaN            NaN
 788                                   NaN         NaN            NaN
 789                                   NaN         NaN            NaN

 [790 rows x 4 columns],
                                                   year
 0                                                 2022  \
 1                                                 2022
 2                                                 2022
 3                                                 2022
 4                                                 2022
 ..                                                 ...
 785                     ‡ Reporting standards not met.
 786                                   — Not available.
 787                                  † Not applicable.
 788  NOTE: B-S-J-G (China) refers to the four PISA ...
 789  SOURCE: Organization for Economic Cooperation ...

                              jurisdiction     average standard_error
 0    Selected countries and jurisdictions  435.037917       0.295268
 1            International Average (OECD)  475.588873       0.452402
 2                               Australia   498.05094       2.013591
 3                                 Austria  480.405847       2.668254
 4                                 Belgium  478.852668       2.523596
 ..                                    ...         ...            ...
 785                                   NaN         NaN            NaN
 786                                   NaN         NaN            NaN
 787                                   NaN         NaN            NaN
 788                                   NaN         NaN            NaN
 789                                   NaN         NaN            NaN

 [790 rows x 4 columns],
                                                   year
 0                                                 2022  \
 1                                                 2022
 2                                                 2022
 3                                                 2022
 4                                                 2022
 ..                                                 ...
 785                     ‡ Reporting standards not met.
 786                                   — Not available.
 787                                  † Not applicable.
 788  NOTE: B-S-J-G (China) refers to the four PISA ...
 789  SOURCE: Organization for Economic Cooperation ...

                              jurisdiction     average standard_error
 0    Selected countries and jurisdictions  446.893945       0.282993
 1            International Average (OECD)  484.646614       0.435314
 2                               Australia  507.000869       1.933076
 3                                 Austria  491.270959       2.650135
 4                                 Belgium  490.578346       2.481873
 ..                                    ...         ...            ...
 785                                   NaN         NaN            NaN
 786                                   NaN         NaN            NaN
 787                                   NaN         NaN            NaN
 788                                   NaN         NaN            NaN
 789                                   NaN         NaN            NaN

 [790 rows x 4 columns]]

In [8]:
PISA_m.sample(5)

     year       jurisdiction     average standard_error
529  2006      United States  474.352158       4.020512
513  2006             Latvia  486.166083       3.027108
49   2022  Brunei Darussalam  442.093104        0.92599
613  2003         Luxembourg  493.208557       0.971641
348  2012     Chinese Taipei  559.824796       3.297632

In [9]:
PISA_r.sample(5)

     year     jurisdiction     average standard_error
136  2018   United Kingdom  503.928109       2.582591
419  2009      Netherlands  508.403723       5.149581
472  2009         Paraguay           —              †
416  2009        Lithuania  468.442734       2.391073
541  2006  B-S-J-Z (China)           —              †

In [10]:
PISA_sc.sample(5)

     year       jurisdiction     average standard_error
139  2018     Albania (2015)           —              †
61   2022  Hong Kong (China)   520.41868       2.792847
325  2012           Portugal  489.274733        3.74672
653  2003         Kazakhstan           —              †
684  2003         Uzbekistan           —              †

Change the types for two columns and round the numbers:

In [11]:
dataframes = [PISA_m, PISA_r, PISA_sc]

for df in dataframes:
    df['average'] = df['average'].apply(pd.to_numeric, errors='coerce')
    df['average'] = df['average'].round(2)

    df['standard_error'] = df['standard_error'].apply(pd.to_numeric, errors='coerce')
    df['standard_error'] = df['standard_error'].round(2)

In [12]:
PISA_m.sample(5)

     year                  jurisdiction  average  standard_error
133  2018                        Sweden   502.39            2.65
582  2006                       Ukraine      NaN             NaN
542  2006                      Bulgaria   413.45            6.13
491  2006  International Average (OECD)   490.41            0.50
126  2018                   New Zealand   494.49            1.71

In [13]:
PISA_r.sample(5)

     year jurisdiction  average  standard_error
703  2000      Iceland   506.93            1.45
669  2003         Peru      NaN             NaN
472  2009     Paraguay      NaN             NaN
7    2022     Colombia   408.67            3.75
471  2009       Panama      NaN             NaN

In [14]:
PISA_sc.sample(5)

     year jurisdiction  average  standard_error
308  2012      Germany   524.12            2.96
507  2006      Iceland   490.79            1.64
771  2000       Russia      NaN             NaN
301  2012     Colombia   398.68            3.05
185  2018       Serbia   439.87            3.05

---

# Exploratory Data Analysis - EDA
- understand the data
- drop unneeded columns
- duplicates
- missing values
- descriptive statistics
- extreme values / outliers

In [15]:
PISA_m.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 790 entries, 0 to 789
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   year            789 non-null    object
 1   jurisdiction    784 non-null    object
 2   average         457 non-null    float64
 3   standard_error  457 non-null    float64
dtypes: float64(2), object(2)
memory usage: 24.8+ KB

In [16]:
PISA_r.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 790 entries, 0 to 789
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   year            789 non-null    object
 1   jurisdiction    784 non-null    object
 2   average         498 non-null    float64
 3   standard_error  498 non-null    float64
dtypes: float64(2), object(2)
memory usage: 24.8+ KB

In [17]:
PISA_sc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 790 entries, 0 to 789
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   year            789 non-null    object
 1   jurisdiction    784 non-null    object
 2   average         416 non-null    float64
 3   standard_error  416 non-null    float64
dtypes: float64(2), object(2)
memory usage: 24.8+ KB

Check for duplicates

In [18]:
PISA_m.duplicated().value_counts()

False    790
Name: count, dtype: int64

In [19]:
PISA_r.duplicated().value_counts()

False    790
Name: count, dtype: int64

In [20]:
PISA_sc.duplicated().value_counts()

False    790
Name: count, dtype: int64

Check for missing values.

In [21]:
PISA_m.isnull().sum()

year                1
jurisdiction        6
average           333
standard_error    333
dtype: int64

In [22]:
PISA_r.isnull().sum()

year                1
jurisdiction        6
average           292
standard_error    292
dtype: int64

In [23]:
PISA_sc.isnull().sum()

year                1
jurisdiction        6
average           374
standard_error    374
dtype: int64

In [24]:
PISA_m = PISA_m.tail(-2)
PISA_m = PISA_m.head(-6)

PISA_r = PISA_r.tail(-2)
PISA_r = PISA_r.head(-6)

PISA_sc = PISA_sc.tail(-2)
PISA_sc = PISA_sc.head(-6)

In [25]:
PISA_m

     year                jurisdiction  average  standard_error
2    2022                   Australia   487.08            1.78
3    2022                     Austria   487.27            2.34
4    2022                     Belgium   489.49            2.20
5    2022                      Canada   496.95            1.56
6    2022                       Chile   411.70            2.08
..    ...                         ...      ...             ...
779  2000  Ukraine (18 of 27 Regions)      NaN             NaN
780  2000        United Arab Emirates      NaN             NaN
781  2000                     Uruguay      NaN             NaN
782  2000                  Uzbekistan      NaN             NaN
783  2000                    Viet Nam      NaN             NaN

[782 rows x 4 columns]

In [26]:
PISA_r

     year                jurisdiction  average  standard_error
2    2022                   Australia   498.05            2.01
3    2022                     Austria   480.41            2.67
4    2022                     Belgium   478.85            2.52
5    2022                      Canada   507.13            1.97
6    2022                       Chile   447.98            2.63
..    ...                         ...      ...             ...
779  2000  Ukraine (18 of 27 Regions)      NaN             NaN
780  2000        United Arab Emirates      NaN             NaN
781  2000                     Uruguay      NaN             NaN
782  2000                  Uzbekistan      NaN             NaN
783  2000                    Viet Nam      NaN             NaN

[782 rows x 4 columns]

In [27]:
PISA_sc

     year                jurisdiction  average  standard_error
2    2022                   Australia   507.00            1.93
3    2022                     Austria   491.27            2.65
4    2022                     Belgium   490.58            2.48
5    2022                      Canada   515.02            1.93
6    2022                       Chile   443.54            2.47
..    ...                         ...      ...             ...
779  2000  Ukraine (18 of 27 Regions)      NaN             NaN
780  2000        United Arab Emirates      NaN             NaN
781  2000                     Uruguay      NaN             NaN
782  2000                  Uzbekistan      NaN             NaN
783  2000                    Viet Nam      NaN             NaN

[782 rows x 4 columns]

Do some descriptive statistics.

In [28]:
PISA_m.describe()

          average  standard_error
count  455.000000      455.000000
mean   462.632330        2.613473
std     56.296721        0.989505
min    317.960000        0.290000
25%    417.355000        2.020000
50%    478.820000        2.580000
75%    502.915000        3.165000
max    591.390000        6.740000

In [29]:
PISA_r.describe()

          average  standard_error
count  496.000000      496.000000
mean   461.038690        2.789980
std     51.507665        1.143279
min    312.210000        0.300000
25%    420.912500        2.192500
50%    477.400000        2.730000
75%    499.312500        3.382500
max    556.020000        9.860000

In [30]:
PISA_sc.describe()

          average  standard_error
count  414.000000      414.000000
mean   465.391039        2.554614
std     52.028351        0.922299
min    331.640000        0.280000
25%    419.955000        2.060000
50%    480.010000        2.550000
75%    503.910000        3.070000
max    590.450000        6.110000

---

Create new DataFrames, for each subject and year one DataFrame:

In [31]:
years = ['2000', '2003', '2006', '2009', '2012', '2015', '2018', '2022']

# Create a new list to safe the new DataFrames
new_dataframes = []

# Iterate over every year
for year in years:
    # Filter the row for every DataFrame for each year
    PISA_m_year = PISA_m[PISA_m['year'] == year].copy()
    PISA_r_year = PISA_r[PISA_r['year'] == year].copy()
    PISA_sc_year = PISA_sc[PISA_sc['year'] == year].copy()
    
    # Add the new DataFrames to the list
    new_dataframes.extend([PISA_m_year, PISA_r_year, PISA_sc_year])

# Save the newly created DataFrames in new Variables
PISA_m_2000, PISA_r_2000, PISA_sc_2000 = new_dataframes[:3]
PISA_m_2003, PISA_r_2003, PISA_sc_2003 = new_dataframes[3:6]
PISA_m_2006, PISA_r_2006, PISA_sc_2006 = new_dataframes[6:9]
PISA_m_2009, PISA_r_2009, PISA_sc_2009 = new_dataframes[9:12]
PISA_m_2012, PISA_r_2012, PISA_sc_2012 = new_dataframes[12:15]
PISA_m_2015, PISA_r_2015, PISA_sc_2015 = new_dataframes[15:18]
PISA_m_2018, PISA_r_2018, PISA_sc_2018 = new_dataframes[18:21]
PISA_m_2022, PISA_r_2022, PISA_sc_2022 = new_dataframes[21:]

In [32]:
dataframes = [PISA_m_2000, PISA_r_2000, PISA_sc_2000,
              PISA_m_2003, PISA_r_2003, PISA_sc_2003,
              PISA_m_2006, PISA_r_2006, PISA_sc_2006,
              PISA_m_2009, PISA_r_2009, PISA_sc_2009,
              PISA_m_2012, PISA_r_2012, PISA_sc_2012,
              PISA_m_2015, PISA_r_2015, PISA_sc_2015,
              PISA_m_2018, PISA_r_2018, PISA_sc_2018,
              PISA_m_2022, PISA_r_2022, PISA_sc_2022]

for df in dataframes:
    df.reset_index(inplace=True, drop=True)

Check that only one year is saved in each DataFrame:

In [33]:
print(PISA_m_2000['year'].unique(), 
      PISA_m_2003['year'].unique(), 
      PISA_m_2006['year'].unique(), 
      PISA_m_2009['year'].unique(), 
      PISA_m_2012['year'].unique(), 
      PISA_m_2015['year'].unique(), 
      PISA_m_2018['year'].unique(), 
      PISA_m_2022['year'].unique())

['2000'] ['2003'] ['2006'] ['2009'] ['2012'] ['2015'] ['2018'] ['2022']

In [34]:
print(PISA_r_2000['year'].unique(),
    PISA_r_2003['year'].unique(),
    PISA_r_2006['year'].unique(),
    PISA_r_2009['year'].unique(),
    PISA_r_2012['year'].unique(),
    PISA_r_2015['year'].unique(),
    PISA_r_2018['year'].unique(),
    PISA_r_2022['year'].unique())

['2000'] ['2003'] ['2006'] ['2009'] ['2012'] ['2015'] ['2018'] ['2022']

In [35]:
print(PISA_sc_2000['year'].unique(),
    PISA_sc_2003['year'].unique(),
    PISA_sc_2006['year'].unique(),
    PISA_sc_2009['year'].unique(),
    PISA_sc_2012['year'].unique(),
    PISA_sc_2015['year'].unique(),
    PISA_sc_2018['year'].unique(),
    PISA_sc_2022['year'].unique())

['2000'] ['2003'] ['2006'] ['2009'] ['2012'] ['2015'] ['2018'] ['2022']

---

Write the DataFrames to the database:

In [36]:
sf.get_engine()

Engine(postgresql://user:***@host/database)

In [37]:
dataframes = [PISA_m_2000, PISA_r_2000, PISA_sc_2000,
              PISA_m_2003, PISA_r_2003, PISA_sc_2003,
              PISA_m_2006, PISA_r_2006, PISA_sc_2006,
              PISA_m_2009, PISA_r_2009, PISA_sc_2009,
              PISA_m_2012, PISA_r_2012, PISA_sc_2012,
              PISA_m_2015, PISA_r_2015, PISA_sc_2015,
              PISA_m_2018, PISA_r_2018, PISA_sc_2018,
              PISA_m_2022, PISA_r_2022, PISA_sc_2022]

table_names = ['pisa_m_2000', 'pisa_r_2000', 'pisa_sc_2000',
              'pisa_m_2003', 'pisa_r_2003', 'pisa_sc_2003',
              'pisa_m_2006', 'pisa_r_2006', 'pisa_sc_2006',
              'pisa_m_2009', 'pisa_r_2009', 'pisa_sc_2009',
              'pisa_m_2012', 'pisa_r_2012', 'pisa_sc_2012',
              'pisa_m_2015', 'pisa_r_2015', 'pisa_sc_2015',
              'pisa_m_2018', 'pisa_r_2018', 'pisa_sc_2018',
              'pisa_m_2022', 'pisa_r_2022', 'pisa_sc_2022']

for df, table_name in zip(dataframes, table_names):
    sf.push_to_cloud(df, table_name)

The pisa_m_2000 table was imported successfully.
The pisa_r_2000 table was imported successfully.
The pisa_sc_2000 table was imported successfully.
The pisa_m_2003 table was imported successfully.
The pisa_r_2003 table was imported successfully.
The pisa_sc_2003 table was imported successfully.
The pisa_m_2006 table was imported successfully.
The pisa_r_2006 table was imported successfully.
The pisa_sc_2006 table was imported successfully.
The pisa_m_2009 table was imported successfully.
The pisa_r_2009 table was imported successfully.
The pisa_sc_2009 table was imported successfully.
The pisa_m_2012 table was imported successfully.
The pisa_r_2012 table was imported successfully.
The pisa_sc_2012 table was imported successfully.
The pisa_m_2015 table was imported successfully.
The pisa_r_2015 table was imported successfully.
The pisa_sc_2015 table was imported successfully.
The pisa_m_2018 table was imported successfully.
The pisa_r_2018 table was imported successfully.
The pisa_sc_2018 table was imported successfully.
The pisa_m_2022 table was imported successfully.
The pisa_r_2022 table was imported successfully.
The pisa_sc_2022 table was imported successfully.

One can also create a dictionary to name the DataFrames - but pay attention: the DataFrame has to be the value and can't be the key!

In [38]:
# test = {'name1': 'df1',
#         'name2': 'df2',
#         'name3': 'df3'}

# for table_name, df in test.items():
#     print(df, table_name)

---

-- Extra Credit: Change the types for two columns and round the numbers (doppel gemoppelt - we did it at the beginning)

In [39]:
# dataframes = [PISA_m_2000, PISA_r_2000, PISA_sc_2000,
#               PISA_m_2003, PISA_r_2003, PISA_sc_2003,
#               PISA_m_2006, PISA_r_2006, PISA_sc_2006,
#               PISA_m_2009, PISA_r_2009, PISA_sc_2009,
#               PISA_m_2012, PISA_r_2012, PISA_sc_2012,
#               PISA_m_2015, PISA_r_2015, PISA_sc_2015,
#               PISA_m_2018, PISA_r_2018, PISA_sc_2018,
#               PISA_m_2022, PISA_r_2022, PISA_sc_2022]

# for df in dataframes:
#     df['average'] = df['average'].apply(pd.to_numeric, errors='coerce')
#     df['average'] = df['average'].round(2)

#     df['standard_error'] = df['standard_error'].apply(pd.to_numeric, errors='coerce')
#     df['standard_error'] = df['standard_error'].round(2)

Two other ways to do it:

In [40]:
# dataframes = [PISA_m_2000, PISA_r_2000, PISA_sc_2000,
#               PISA_m_2003, PISA_r_2003, PISA_sc_2003,
#               PISA_m_2006, PISA_r_2006, PISA_sc_2006,
#               PISA_m_2009, PISA_r_2009, PISA_sc_2009,
#               PISA_m_2012, PISA_r_2012, PISA_sc_2012,
#               PISA_m_2015, PISA_r_2015, PISA_sc_2015,
#               PISA_m_2018, PISA_r_2018, PISA_sc_2018,
#               PISA_m_2022, PISA_r_2022, PISA_sc_2022]

# for df in dataframes:
#     df['average'] = df['average'].astype(str).replace({'—': np.nan, '‡': np.nan, '†': np.nan})
#     df['average'] = df['average'].astype(float)
#     df['average'] = df['average'].round(2)

#     df['standard_error'] = df['standard_error'].astype(str).replace({'—': np.nan, '‡': np.nan, '†': np.nan})
#     df['standard_error'] = df['standard_error'].astype(float)
#     df['standard_error'] = df['standard_error'].round(2)

In [41]:
# df['average'] = df['average'].astype('str')
# df['average'] = df['average'].str.replace('-', '0')
# df['average'] = df['average'].astype